# url
https://gihyo.jp/magazine/wdpress/archive/2019/vol108

# Description
2018年12月22日発売
B5判／168ページ
定価（本体1,480円＋税）
ISBN 978-4-297-10324-8

## 特集1
［効率急上昇！］スキーマ駆動Web API開発
OpenAPI/GraphQLで仕様からコードもテストも作成

### 第1章：スキーマ駆動開発とは何か
Web API開発を効率化する新しいスタイル……大和田 純，中野 暁人

### 第2章：OpenAPIの基本
REST APIの仕様をスキーマとして記述する……中野 暁人

### 第3章：OpenAPIによるスキーマ駆動開発
クライアント／スタブサーバの生成，サーバ開発時のバリデーション……山本 浩平

### 第4章：GraphQLによるスキーマ駆動開発
API仕様とクエリ言語を組み合わせて柔軟にデータを取得する……山本 浩平

## 特集2
詳解PostgreSQL
［10/11対応］現場で役立つ新機能と実践知識

### 第1章：PostgreSQLの今昔を知る
20年を超える歴史，リリースサイクル，環境構築……曽根 壮大

### 第2章：PostgreSQLの内部構造
プロセスやメモリの流れ，特徴的な機能のしくみ……曽根 壮大

### 第3章：アプリケーション開発に便利な機能
Window関数，ストアドファンクション／プロシージャ，JIT，パラレルクエリ……曽根 壮大

### 第4章：PostgreSQLの運用に便利な機能
バックアップ，レプリケーション，パーティション，バージョンアップ……曽根 壮大

## 特集3
ZOZO開発ノウハウ大公開
既存資産を活かしたシステムリプレース

### 第1章：ZOZOTOWNのシステムリプレース
既存システムの制約のもと，柔軟さと堅牢さを実現……ZOZOTOWNリプレースチーム

### 第2章：ZOZOTOWNのパブリッククラウド活用
KubernetesでAzure上に信頼性の高いシステムを構築……ZOZOTOWNリプレースチーム

### 第3章：ZOZOTOWNのSQL Server活用
マネージドサービスSQL Databaseを活かした効率的な運用……ZOZOTOWNリプレースチーム

### 第4章：ZOZOTOWNのシステム監視
Datadog，PagerDutyによるモダンな監視……ZOZOTOWNリプレースチーム

### 第5章：ZOZOのグローバルECサイトの立ち上げ
新規サービス開発における技術選定と国際化対応……権守 健嗣，茨木 暢仁，松井 菜穂子

## 18周年記念エッセイ
壁の先に見えたもの
限界！ もうダメ！ もはやこれまで！？

### 第1章：“この先生きのこる”軸足を求めて
ソロの限界，チームの壁……新多 真琴

### 第2章：フルスタックエンジニアの憂鬱
スペシャリスト全盛という壁……laiso

### 第3章：コンピューテーショナルデザインの挑戦
他人や社会との「共有」という壁……豊田 啓介

### 第4章：こんな仕事のしかたをしていては死ぬな
外の世界を知り，壁を乗り越える……藤原 俊一郎

## 連載
- Goに入りては…… ── When In Go...  
【第10回】あなたの知らないGoテスト ……直列・並行テストとの付き合い方……牧 大輔

- どんとこい！ フロントエンド開発  
【第10回】GatsbyJSでモダンなWebサイトをらくらく開発！……向井 咲人

- 事業を支えるPHP  
【第7回】やり方いろいろ！ ユニットテスト ……手軽なassert()とphpt，高機能なPHPUnitとPhake……大島 一将

- Perl Hackers Hub  
【第53回】Cを用いたPerl拡張入門 ……Inline::Cで体験してみよう！……上川 慶　監修：牧 大輔，松木 雅幸，大沢 和宏

- Dive to Java ── OpenJDK開発者が明かす，最新開発／運用テクニック  
【第4回】詳解Flight Recorder ……Java 11新搭載！ トラブルシュートに役立つ情報収集ツール……末永 恭正，久保田 祐史

- 大規模インフラ解体新書 ── ソフトウェアエンジニアリングの視点から  
【第4回】Webインフラのセキュリティログ ……Graylogで収集／分析基盤を作り，osqueryでサーバの状態を集める……星 北斗

## コラム
- 縁の下のUIデザイン ── 少しの工夫で大きな改善！  
【第11回】異なるユーザー層へのデザイン ……出品者／購入者，初心者／上級者…………池田 拓司

- at the front ── 前線にて  
【第2回】JavaScriptの呪いから解き放たれて ……スマートニュース㈱　天野 仁史さん……竹馬 光太郎

- はまちちゃんとわかばちゃんのREADER'S FORUM ── 読者のページ  
【第59回】……はまちや2，竹原

## Special Report
- Scala関西Summit 2018
……粕谷 大輔

## 特別広報
- KADOKAWAだからこそできる新しいコンテンツ配信を  
IPとITを組み合わせて世界へ（前編）……編集部

- MixChannelを支える技術  
【第2回】ライブ配信を支えるサーバシステムと運用技術……Takuto Takahashi，Kenta Takano
